app/Http/Controllers/Auth/LoginController.php

select * from `store_users` where `store_users`.`user_id` in (66)
select * from `users` where `email` = 'seth.atam@gmail.com' limit 1
---
    public function authenticate(Request $request)
    {
        try {
            $credentials = $request->only('email', 'password');
            $storeId = request('storeId');

            $validator = Validator::make($credentials, [
                'email' => ['required', 'string', 'email'],
                'password' => ['required', 'string'],
            ]);

            if ($validator->fails()) {
                $notification = [
                    "title" => "Validation Errors",
                    "type" => "failed",
                    "message" => "Request Failed Validation",
                    "validationErrors" => $validator->errors(),
                ];
                return response()->json(['notification' => $notification], 400);
            }

            $user = User::with('store_users')
                ->where('email', $request->email)->first();