app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request)
    {
        return array_merge(parent::share($request), [
            //
            'appName' => config('app.name'),
            'store'=>Store::with('domains')->with('payment_gateways')->with('currency')->with('weight')->where('id', session()->get('store_id'))->first()
---
select * from `currencies` where `currencies`.`id` in (66)
select * from `stores` where `id` is null limit 1