app/Http/Controllers/OnlineStore/CodeEditorController.php

    public function index(Request $request)
    {
        //
        // $store = Store::with('theme')->find(session()->get('store_id'));

        $theme_files = [];
        $theme = Theme::with('files')
            ->whereHas('store', function($query) use ($request) {
                $query->where('id', $request->session()->get('store_id'));
        })->first();

        $files = $theme->files;
        $s = $files->groupBy('type');

        dd($s->all());


        $open_files = OpenEditorPage::with('theme_file')->orderBy('id', 'asc')->get();
---
select * from `open_editor_pages` where `store_id` = 2 order by `id` asc
select * from `theme_files` where `theme_files`.`id` in (2, 3, 16) and `store_id` = 2