app/Http/Controllers/OrdersController.php

    public function index(Request $request)
    {
        // \Log::info("Get order request Received".print_r($request->all(), true));
        //
        $filters = $request->all('search', 'from', 'to', 'user');
        // $orders = Order::whereHas('user')->with('user')->with('items')->orderBy('id', 'asc')->paginate(50);

       $orders = Order::whereHas('user', function($query){
            // $query->addSelect(['total_orders'=>Order::selectRaw('sum(total) as total_sum')
            //                 ->whereColumn('store_id', 'orders.store_id'),
            // ]);
       })->with('user')->withTotalOrders()->withAverageOrders()
            ->with('items')
            ->with('tags')
            ->orderBy('id', 'asc')->paginate(50);
---
select * from `users` where 0 = 1
select * from `users` where `users`.`id` in (39, 43, 44, 66)
select `orders`.*, (select sum(total) as total_orders from `orders` where `store_id` = `orders`.`store_id` and `user_id` = `orders`.`user_id` and `user_id` = 'orders.user_id' and `store_id` = 2) as `total_orders`, (select avg(total) as average_orders from `orders` where `store_id` = `orders`.`store_id` and `user_id` = `orders`.`user_id` and `store_id` = 2) as `average_orders` from `orders` where exists (select * from `users` where `orders`.`user_id` = `users`.`id`) and `store_id` = 2 order by `id` asc limit 50 offset 0
select count(*) as aggregate from `orders` where exists (select *, (select sum(total) as total_sum from `orders`) as `total_orders` from `users` where `orders`.`user_id` = `users`.`id`)

    public function show($id, $notification = null )
    {
        $order = Order::with('items')->with('tags')->with('user')->with('activities')->where('id', $id)->first();
---
select * from `orders` where `id` = '9' limit 1
select * from `users` where `users`.`id` in (66)